gestionatr/data/RegistroPS.wsdl

<?xml version="1.0" encoding="UTF-8"?>
<wsdl:definitions xmlns:ns1="http://schemas.xmlsoap.org/soap/http" xmlns:soap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:tns="http://localhost/sctd/ws/rps" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:tnswsrps="http://localhost/sctd/wsrps" name="RegistroPSService" targetNamespace="http://localhost/sctd/ws/rps">
	<wsdl:import namespace="http://localhost/sctd/wsrps" location="WebserviceRPS.xsd"/>
	<wsdl:message name="consultaCupsResponse">
		<wsdl:part name="parameters" element="tnswsrps:consultaCupsResponse">
    </wsdl:part>
	</wsdl:message>
	<wsdl:message name="consultaCups">
		<wsdl:part name="parameters" element="tnswsrps:consultaCups">
    </wsdl:part>
	</wsdl:message>
	<wsdl:portType name="RegistroPS">
		<wsdl:operation name="consultaCups">
			<wsdl:input name="consultaCups" message="tns:consultaCups">
    </wsdl:input>
			<wsdl:output name="consultaCupsResponse" message="tns:consultaCupsResponse">
    </wsdl:output>
		</wsdl:operation>
	</wsdl:portType>
	<wsdl:binding name="RegistroPSServiceSoapBinding" type="tns:RegistroPS">
		<soap:binding style="document" transport="http://schemas.xmlsoap.org/soap/http"/>
		<wsdl:operation name="consultaCups">
			<soap:operation soapAction="" style="document"/>
			<wsdl:input name="consultaCups">
				<soap:body use="literal"/>
			</wsdl:input>
			<wsdl:output name="consultaCupsResponse">
				<soap:body use="literal"/>
			</wsdl:output>
		</wsdl:operation>
	</wsdl:binding>
	<wsdl:service name="RegistroPSService">
		<wsdl:port name="RegistroPSPort" binding="tns:RegistroPSServiceSoapBinding">
			<soap:address location="http://localhost:7777/sctd/ws/RegistroPS"/>
		</wsdl:port>
	</wsdl:service>
</wsdl:definitions>
